{
  "translations": {
    "header": {
      "title": "Full Stack Web Developer",
      "ps": [
        "I'm an Information Systems Engineer, passionate about programming and eager to learn.",
        "I love creating solutions to real life problems and tools to improve people's lives."
      ],
      "personalInfo": "About me",
      "skills": "Skills",
      "projects": "Projects",
      "contactMe": "Contact me"
    },
    "skills": {
      "description": "As an Information Systems Engineer, I've learned a wide set of skills, all the way from server management and networking to coding and UI/UX. I've specialized in web development.",
      "database": "Database & data Access",
      "technicalSkills": "Technical Skills",
      "beginner": "beginner",
      "jwtAuthentication": "JWT Authentication",
      "oop": "OOP",
      "otherSkills": "Other skills",
      "languages": "I speak Spanish (native) and English (advanced)",
      "3d": "3D modelling: Blender & Cinema 4D",
      "photoshop": "Intermediate Photoshop & GIMP"
    },
    "projects": {
      "hoverToZoom": "Hover to zoom",
      "technologiesUsed": "Technologies used:",
      "seeOnGooglePlay": "See on Google Play",
      "sourceCode": "Source Code",
      "seeOnline": "See online",
      "list": [
        {
          "title": "ECO Library management",
          "ps": [
            "Developed to cover the specific needs of a prestigious private school. Provides students with the ability to search books with various filtering options and to register media usage. Administrative users can manage books, authors, publishers, tags, book loans, and access reports.",
            "One of the key elements in this project was keeping the user experience simple, so that the software was intuitive and easy to use for everybody, even the youngest students, without compromising functionality."
          ]
        },
        {
          "title": "Webcam4all",
          "ps": [
            "This Android app turns the user's phone into a 1080p wireless webcam for Windows or macOS. It takes every frame from the camera, encodes it into JPEG, and sends it over HTTP to the client through wi-fi.",
            "The biggest challenge was to provide a low latency and reliable stream of data while maintaining the image quality.",
            "Since wireless transmissions can be unstable, the client sends requests periodically to a status endpoint that returns the number of the last sent frame to make sure the connection is working. If, for some reason, the server stopped processing frames or the connection was lost, the client will try to reconnect automatically"
          ]
        },
        {
          "title": "Webcam4all website",
          "ps": ["Created to showcase the app and how to set it up."]
        },
        {
          "title": "This site",
          "printTitle": "My online portfolio",
          "description": "You know what this one is about.",
          "printDescription": "It is the online version of this document. Check it out for a more interactive experience."
        },
        {
          "title": "3D modelling",
          "seeOnTS": "See on Turbosquid.com",
          "ps": [
            "I craft 3D models in my free time. They're available for purchase at Turbosquid, the biggest 3D models marketplace. I use Blender for modelling and Substance Painter for texturing. I've also used Cinema 4D in the past."
          ]
        }
      ]
    },
    "aboutMe": {
      "languages": "Languages I speak",
      "languagesList": ["Spanish (native)", "English (advanced)"],
      "location": "Location",
      "locationList": [
        "Country of residence: El Salvador, Central America",
        "Time zone: GMT-6 (My schedule is flexible, I'm available 24/7)"
      ],
      "education": "Education",
      "informationSystems": "Information systems Engineering at Universidad de El Salvador",
      "informationSystemsList": [
        "Finished studies, to graduate with honors",
        "Graduation process has been delayed because of the pandemic"
      ]
    }
  }
}
